(require 'tamil-grammar-brute-knowledge)
(defvar tml-suffix-um-knowledge
  `(
    ("\\<ம\\'" . "மற்றும்") ;;most frequent words... 
    ("\\<ே\\'" . "வேண்டும்") ;;most frequent words... 
    ("\\<ெ\\'" . "என்னும்") ;;most frequent words... 
    ("\\<எ\\'" . "என்றும்") ;;most frequent words... 
    ("\\<ப\\'" . "பற்றியும்") ;;most frequent words... 
    ("\\<ி\\'" . "இருக்கும்") ;;most frequent words... 
    ("\\<இ\\'" . "இன்னும்")
    ("\\<ட\\'" . "இடம்பெறும்") 

    ("\\<்\\'" . "அனைத்தையும்") 

;    (("மு$" "ண$") . "\\&டியும்") ;; முடியும்



    (,words-ending-with-yum  . "\\&யும்")
    (,words-ending-with-kum-1  . "\\&கும்")
    (,words-ending-with-kum-2  . "\\&கும்")
    (,words-ending-with-lum-1  . "\\&லும்")
    (,words-ending-with-lum-2  . "\\&லும்")
    (,words-ending-with-bigrum  . "\\&றும்")
    (,words-ending-with-dum  . "\\&டும்")
    (,words-ending-with-biglum  . "\\&ளும்")
    (,words-ending-with-rum  . "\\&ரும்")
    (,words-ending-with-thum  . "\\&தும்")
    (,words-ending-with-num  . "\\&னும்")
    (,words-ending-with-mum  . "\\&மும்")
    (,words-ending-with-vum-1  . "\\&வும்")
    (,words-ending-with-vum-2  . "\\&வும்")

    (,words-ending-with-pum  . "\\&பும்")
    (,words-ending-with-zhum  . "\\&ழும்")
    (,words-ending-with-bignum  . "\\&ணும்")
    (,words-ending-with-sum  . "\\&சும்")


    ("வேண்\\'" . "\\&டும்") ;;வேண்டும் என முடியும் வார்த்தைகள்
    ("கொள்\\'" . "\\&ளும்") ;;கொள்ளும் என முடியும் வார்த்தைகள்


    ("[நத]்தா\\'" . "\\&லும்") ;;லும்       ந்தா த்தா
    ("களி\\'" . "\\&லும்") ;;லும்
    ("களா\\'" . "\\&லும்") ;;லும்
    ("\\(.\\)்\\1ி\\'" . "\\&லும்") ;;லும்    பேச்சிலும் தலைப்பிலும், திக்கிலும் ... வீட்டிலும்

    ("[ைிா]\\'" . "\\&யும்")
    ("[ெொ]ய்\\'" . "\\&யும்") ;பெய்யும் பொய்யும் செய்யும்
    ("ல்\\'" . "லும்")
    ("ழ்\\'" . "\\&வும்")
    ("கள்\\'". "களும்")
    ("ங[்]?\\'" . "ங்கும்")
    ("ு\\'" . "\\&க்கும்")

    ("\\([கதபறசடண]\\)்\\'" . "\\1்\\1ும்")
    ("தென்\\'" . "தென்றும்"); later make more sophisticated...
    ("\\'" . "\\&ும்")
    )
"Associative list of ும் suffices")

(defvar tml-suffix-il-knowledge
  `(
    ("\\<ப\\'" . "பாடல்களில்") ;;most frequent words... PHD
    ("\\<சப\\'" . "சங்கப் பாடல்களில்") ;;most frequent words... PHD
    ("\\<சி\\'" . "சங்க இலக்கியத்தில்") ;;most frequent words... PHD
    ("\\<புறநானூறு\\'" . "புறநானூற்றில்") ;;most frequent words... PHD
    ("\\<அகநானூறு\\'" . "அகநானூற்றில்") ;;most frequent words... PHD
    ("\\<தொல்காப்பிய\\'" . "தொல்காப்பியத்தில்") ;;most frequent words... PHD
    ("\\<இலக்கிய\\'" . "இலக்கியத்தில்") ;;most frequent words... PHD
    ("\\<இக்\\'" . "இக்கட்டுரையில்") ;;most frequent words... PHD
    ("\\<உள்ள\\'" . "உள்ளத்தில்") ;;most frequent words... PHD
    
    ("\\<ி\\'" . "இதில்") ;;most frequent words... 
    ("\\<்\\'" . "அதில்") ;;most frequent words... 
    ("\\<ெ\\'" . "எதில்") ;;most frequent words... 


    (,words-ending-with-yil  . "\\&யில்")
    (,words-ending-with-thil  . "\\&தில்")
    (,words-ending-with-biglil  . "\\&ளில்")
    (,words-ending-with-lil  . "\\&லில்")
    (,words-ending-with-vil  . "\\&வில்")
    (,words-ending-with-ril  . "\\&ரில்")
    (,words-ending-with-kil  . "\\&கில்")
    (,words-ending-with-pil  . "\\&பில்")
    (,words-ending-with-dil  . "\\&டில்")
    (,words-ending-with-zhil  . "\\&ழில்")
    (,words-ending-with-bigril  . "\\&றில்")
    (,words-ending-with-nil  . "\\&னில்")

    (,words-ending-with-mil  . "\\&மில்")
    (,words-ending-with-sil  . "\\&சில்")
    (,words-ending-with-northsil  . "\\&ஸில்") ;vadamozhi sil
    (,words-ending-with-bignil  . "\\&ணில்")

    ("[ைி]\\'" . "\\&யில்")
    ("[ட][ு]\\'" . "\\&வில்") ;நடுவில் 
    ("ழ்\\'" . "\\&வில்")
    ("ங[்]?\\'" . "ங்கில்")
    ("\\([கதபசடற]\\)்\\'" . "\\1்\\1ில்")
    ("கள்\\'" . "களில்")
    ("\\'" . "\\&ில்")
    )
"Associative list of ில் suffices")

(defvar tml-suffix-illai-knowledge
  `(
    ("கள்\\'" . "களில்லை")
    ("ை\\'" . "\\&யில்லை")

    (,words-ending-with-villai  . "\\&வில்லை")
    (,words-ending-with-thillai  . "\\&தில்லை")
    (,words-ending-with-yillai  . "\\&யில்லை")
    (,words-ending-with-millai  . "\\&மில்லை")
    ("\\([கலயள]\\)்\\1?\\'" . "\\1்\\1வில்லை")
    ("\\([த]\\)்\\'" . "\\1்\\1தில்லை")
    ("த்த\\'" . "த்ததில்லை")
    ("டிய\\'" . "\\&தில்லை")
;    ("[யசடபரக]\\'" . "\\&வில்லை") ;not robust
    ("\\'" . "\\&ல்லை")
    )
"Associative list of ல்லை suffices")


(defvar tml-suffix-kal-knowledge
  `(
    ("ூ\\'" . "ூக்கள்")
    ("\\<ி\\'" . "இவர்கள்")
    ("\\<்\\'" . "அவர்கள்")
    ("\\<பண\\'" . "பண்பாட்டுச்சிந்தனைகள்") ;; PHD
    ("\\<ம\\'" . "மொழியியல் அறிஞர்கள்") ;; PHD
    ("\\<இ\\'" . "இலக்கியங்கள்") ;; PHD

    (,words-ending-with-rpointkal-1 . "\\&ர்கள்")
    (,words-ending-with-rpointkal-2 . "\\&ர்கள்")

    (,words-ending-with-ngpointkal . "\\&ங்கள்")
    (,words-ending-with-ikal . "\\&ிகள்")
    (,words-ending-with-varkal . "\\&வர்கள்")

    (,words-ending-with-aarkal-1 . "\\&ார்கள்")
    (,words-ending-with-aarkal-2 . "\\&ார்கள்")

    (,words-ending-with-aikal . "\\&ைகள்")
    (,words-ending-with-kpointkal . "\\&க்கள்")

    ("\\(க்த\\|னா\\|ஸ\\|தவ\\|ிறா\\|்தா\\)\\'" .  "\\&ர்கள்")
 
    ("நீ\\'" . "நீங்கள்")
    ("த\\'" . "தங்கள்")
    ("தா\\'" . "தாங்கள்")
    ("\\<ம\\'" . "மகள்")

    ("[ஙரகணனலடறழயளமஸ]\\'" . "\\&்கள்")
    ("\\'" . "\\&கள்")
    )
"Associative list of கள் suffices")

(defconst most-mey-ezhuthu "\\([கசதபமனணடரவறலளயஜ]\\)்\\'"
"த்தை த்தே போன்று repeat  ஆகும் மெய்யெழுத்துக்கள்"
)
(defconst most-appendages "[ைிாேீ]\\'"
"கொம்பு, கால், சுழி ஆகியவற்றை appendage என்று அழைப்போம்.
தையை தேயே  போன்று ய -வுடன் சேர்த்து அடிக்கவேண்டிய இடங்கள்."
)
(defvar tml-suzhi-ai-knowledge
  `(
    ("\\<மயி\\'" . "மயிலாடுதுறை")
    ("\\<கு\\'" . "குறுந்தொகை")
    ("\\<கலி\\'" . "கலித்தொகை")
    ("\\<திரு\\'" . "திருமுருகாற்றுப்படை")
    ("\\<வா\\'" . "வாழ்க்கை")
    ("\\<ெ\\'" . "என்பதை")
    ("\\<தத\\'" . "தலைவன் தலைவியை")
    

    ("கள்\\'" . "களை")
    ("ங்\\'" . "ங்கை")
    ("ந்\\'" . "ந்தை")
    ("ஞ்\\'" . "ஞ்சை")
    ("\\<௧\\'" . "ஒன்றை")
    ("\\<௨\\'" . "இரண்டை")
    ("\\<௩\\'" . "மூன்றை")
    ("\\<௪\\'" . "நான்கை")
    ("\\<௫\\'" .  "ஐந்தை" )
    ("\\<௬\\'" . "ஆறை")
    ("\\<௭\\'" . "ஏழை")
    ("\\<௮\\'" . "எட்டை")
    ("\\<௯\\'" . "ஒன்பதை")
    (,most-appendages . "\\&யை")
    (,most-mey-ezhuthu . "\\1்\\1ை")
    ("\\'" . "\\&ை")
    )
"-ai knowledge")
(defvar tml-suzhi-ae-nedil-knowledge
  `(
    ("கள்\\'" . "களே")
    ("[ஙற]்\\'" . "\\&கே") ;இங்கே தெற்கே
    ("\\<௧\\'" . "ஒன்றே")
    ("\\<௨\\'" . "இரண்டே")
    ("\\<௩\\'" . "மூன்றே")
    ("\\<௪\\'" . "நான்கே")
    ("\\<௫\\'" . "ஐந்தே")
    ("\\<௬\\'" . "ஆறே")
    ("\\<௭\\'" . "ஏழே")
    ("\\<௮\\'" . "எட்டே")
    ("\\<௯\\'" . "ஒன்பதே")
    ("\\<ொ\\'" . "ஒரே")
    (,most-appendages . "\\&யே")
    (,most-mey-ezhuthu . "\\1்\\1ே")
    ("\\'" . "\\&ே")
    )
"-ae-nedil knowledge")
(defvar tml-suzhi-ae-kuril-knowledge
  `(
    ("கள்\\'" . "களெ")
    (,most-appendages . "\\&யெ")
    (,most-mey-ezhuthu . "\\1்\\1ெ")
    ("\\'" . "\\&ெ")
    )
"-ae-kuril knowledge")
(defvar tml-suzhi-ou-kuril-knowledge
  `(
    ("\\<பு\\'" . "புறநானூறு")
    ("\\<அ\\'" . "அகநானூறு")
    ("\\<ஐ\\'" . "ஐங்குறுநூறு")
    ("\\<மொ\\'" . "மொழியியலுக்கு")

    ("\\<அகநானூறு\\'" . "அகநானூற்று")
    ("\\<புறநானூறு\\'" . "புறநானூற்று")
    ("\\<ஐங்குறுநூறு\\'" . "ஐங்குறுநூற்று")
    ("\\<உ\\'" . "உடன்போக்கு")
    ("\\<ை\\'" . "அனைத்து")
    ("\\<்\\'" . "அல்லது")

    
    ("\\<மு\\'" . "முன்னிட்டு")
    ("\\<ெ\\'" . "என்பது")
    ("\\<௧\\'" . "முதலாவது")
    ("\\<௨\\'" . "இரண்டாவது")
    ("\\<௩\\'" . "மூன்றாவது")
    ("\\<௪\\'" . "நான்காவது")
    ("\\<௫\\'" . "ஐந்தாவது")
    ("\\<௬\\'" . "ஆறாவது")
    ("\\<௭\\'" . "ஏழாவது")
    ("\\<௮\\'" . "எட்டாவது")
    ("\\<௯\\'" . "ஒன்பதாவது")
    ("கள்\\'" . "களு")
    ("ந[்]\\'" . "\\&து") ;வந்து 
    ("ங[்]\\'" . "\\&கு") ;இங்கு 
    ("ஞ[்]\\'" . "\\&சு") ;பஞ்சு 
    ("டெ\\'" . "டெடு")
    ("ு\\'" . "\\&க்கு")
    (,most-appendages . "\\&யு")
    (,most-mey-ezhuthu . "\\1்\\1ு")
    ("\\'" . "\\&ு")
    )
"-ou-kuril knowledge")

(defvar tml-suzhi-ou-nedil-knowledge
  `(
    ("கள்\\'" . "களூ")
    ("ந[்]\\'" . "\\&தூ") ;செந்தூ..
    ("ங[்]\\'" . "\\&கூ") ;நாங்கூ..
    ("ஞ[்]\\'" . "\\&சூ") ;மீஞ்சூ...
    (,most-appendages . "\\&யூ")
    (,most-mey-ezhuthu . "\\1்\\1ூ")
    ("\\'" . "\\&ூ")
    )
"-ou-nedil knowledge")
(defvar tml-suzhi-oo-kuril-knowledge
  `(
    ("\\<ி\\'" . "இன்னொரு")
    ("\\<அ\\'" . "அறத்தொடு")

    ("கள்\\'" . "களொ")
    ("ங[்]\\'" . "\\&கொ") ;இங்கொ...
    (,most-appendages . "\\&யொ")
    (,most-mey-ezhuthu . "\\1்\\1ொ")
    ("\\'" . "\\&ொ")
    )
"-oo-kuril knowledge")
(defvar tml-suzhi-oo-nedil-knowledge
  `(
    ("கள்\\'" . "களோ")
    ("ந[்]\\'" . "\\&தோ") ;
    ("ங[்]\\'" . "\\&கோ") ;
    ("ஞ[்]\\'" . "\\&சோ") ;
    (,most-appendages . "\\&யோ")
    (,most-mey-ezhuthu . "\\1்\\1ோ")
    ("\\'" . "\\&ோ")
    )
"-oo-nedil knowledge")


(defvar tml-suzhi-aa-nedil-knowledge
  `(
    ("கள்\\'" . "களா")
    ("ந்\\'" . "ந்தா")
    ("ங்\\'" . "ங்கா")
    ("\\<௧\\'" . "ஒன்றா")
    ("\\<௨\\'" . "இரண்டா")
    ("\\<௩\\'" . "மூன்றா")
    ("\\<௪\\'" . "நான்கா")
    ("\\<௫\\'" . "ஐந்தா")
    ("\\<௬\\'" . "ஆறா")
    ("\\<௭\\'" . "ஏழா")
    ("\\<௮\\'" . "எட்டா")
    ("\\<௯\\'" . "ஒன்பதா")
    (,most-appendages . "\\&யா")
    (,most-mey-ezhuthu . "\\1்\\1ா")
    ("\\'" . "\\&ா")
    )
"-aa-nedil knowledge")

(defvar tml-suzhi-ii-kuril-knowledge
  `(
    ("\\<உ\\'" . "உணர்ச்சி")
    ("கள்\\'" . "களி")
    ("ந்\\'" . "ந்தி")
    ("ஞ்\\'" . "ஞ்சி")
    ("ங்\\'" . "ங்கி")
    (,most-appendages . "\\&யி")
    (,most-mey-ezhuthu . "\\1்\\1ி")
    ("\\'" . "\\&ி")
    )
"-ii-kuril knowledge")
(defvar tml-suzhi-ii-nedil-knowledge
  `(
    ("கள்\\'" . "களீ")
    ("ந்\\'" . "ந்தீ")
    ("ஞ்\\'" . "ஞ்சீ")
    ("ங்\\'" . "ங்கீ")
    (,most-appendages . "\\&யீ")
    (,most-mey-ezhuthu . "\\1்\\1ீ")
    ("\\'" . "\\&ீ")
    )
"-ii-nedil knowledge")

;;; a kuril IS A SPECIAL CASE
(defvar tml-suzhi-a-kuril-knowledge
  `(
    ("\\<தொ\\'" . "தொல்காப்பிய")
    ("\\<பொ\\'" . "பொருளதிகார")
    ("\\<சொ\\'" . "சொல்லதிகார")
   ("\\<மொ\\'" . "மொழியியல்")
   ("\\<மொழியியல்\\'" . "மொழியியலின்")

    ("\\<சி\\'" . "சிலப்பதிகார")
    ("\\<கம்\\'" . "கம்பராமாயண")
    ("\\<அ\\'" . "அறிவியல்")

    ("\\<ி\\'" . "இலக்கிய")
    ("\\<வா\\'" . "வாழ்வியல்")
    ("\\<வாழ்வியல்\\'" . "வாழ்வியலில்")
    ("\\<உள்ள\\'" . "உள்ளம்")

    ("\\<தலை\\'" . "தலைவன்")
    ("\\<தலைவன்\\'" . "தலைவன் தலைவியின்")

    ("\\<பொருளதிகார\\'" . "பொருளதிகாரம்")
    ("\\<சொல்லதிகார\\'" . "சொல்லதிகாரம்")
    ("\\<தொல்காப்பிய\\'" . "தொல்காப்பியம்")
    ("\\<கம்பராமாயண\\'" . "கம்பராமாயணம்")
    ("\\<சிலப்பதிகார\\'" . "சிலப்பதிகாரம்")
    ("\\<இலக்கிய\\'" . "இலக்கியம்")
    ("\\<இலக்கியம்\\'" . "இலக்கியத்தின்")
    
    

    ("\\<மக்\\'" . "மக்களின்")  ;; PHD

;;    ("ர்\\'" . "ன்") ;; ர் ன் cycle
  ;;  ("ன்\\'" . "ர்")

    ("தில்\\'" . "தின்") ;; தில் தின் cycle இலக்கியத்தில் இலக்கியத்தின்
    ("தின்\\'" . "தில்")

    ("களில்\\'" . "களின்") ;; களில் களின் cycle பாடல்களில் பாடல்களின்
    ("களின்\\'" . "களில்")

    
    ("கள்\\'" . "கள்ள")
    ("ந்\\'" . "ந்த")
    ("ங்\\'" . "ங்க")
    ("\\<௧\\'" . "ஒன்றும்")
    ("\\<௨\\'" . "இரண்டும்")
    ("\\<௩\\'" . "மூன்றும்")
    ("\\<௪\\'" . "நான்கும்")
    ("\\<௫\\'" . "ஐந்தும்")
    ("\\<௬\\'" . "ஆறும்")
    ("\\<௭\\'" . "ஏழும்")
    ("\\<௮\\'" . "எட்டும்")
    ("\\<௯\\'" . "ஒன்பதும்")
    (,(concat "\\(.\\)" most-appendages) . "\\&\\1்")
    (,most-mey-ezhuthu . "\\1்\\1")
    ("\\'" . "\\&்")
    )
"-a-kuril knowledge")

(defvar tml-mey-periya-La-knowledge
  `(
    ("\\<்\\'" . "அமைந்துள்ள")
    ("\\<ி\\'" . "இணையதள")
    ("\\<ட\\'" . "இடம்பெற்றுள்ள")
    ("\\<ு\\'" . "உள்ள")
    ("\\'" . "\\&ள")
    )
"tml-mey-periya-La-knowledge")

(defvar tml-mey-ya-knowledge
  `(
    ("\\<்\\'" . "அழகிய")
    ("\\<ா\\'" . "ஆகிய")
    ("\\<ி\\'" . "இலக்கிய")
    ("\\<ய\\'" . "இயற்றிய")
    ("\\<ு\\'" . "முதலிய")
    ("\\<ெ\\'" . "எழுதிய")
    
    ("\\<ொ\\'" . "ஒன்றிய")
    ("\\<ெ\\'" . "செய்ய")
    ("\\<ே\\'" . "வேண்டிய")
   
    ("\\<்\\'" . "அவருடைய")
    ("\\<ி\\'" . "இலக்கிய")

    ("\\'" . "\\&ய")
    )
"tml-mey-ya-knowledge")

(defvar tml-mey-ta-knowledge
  `(
    ("\\<ி\\'" . "இயற்றப்பட்ட")
    ("\\<ு\\'" . "உள்ளிட்ட")

    ("\\'" . "\\&ட")
    )
"tml-mey-ta-knowledge")

(defvar tml-mey-ka-knowledge
  `(
    ("\\<ி\\'" . "இயல்பாக")
    ("\\<ு\\'" . "உலக")
    ("\\<ெ\\'" . "எடுத்துக்காட்டாக")

    ("\\'" . "\\&க")
    )
"tml-mey-ka-knowledge")

(defvar tml-mey-tha-knowledge
  `(
    ("\\<்\\'" . "அமைந்த")
    ("\\<ி\\'" . "இன்றியமையாத")
    ("\\<ு\\'" . "உயர்ந்த")
    ("\\<ெ\\'" . "எதார்த்த")


    ("\\'" . "\\&த")
    )
"tml-mey-tha-knowledge")

(defvar tml-mey-small-na-knowledge
  `(
    ("\\<ெ\\'" . "என்பன")

    ("\\'" . "\\&ன")
    )
"tml-mey-small-na-knowledge")
(defvar tml-mey-big-na-knowledge
  `(
    ("\\<ி\\'" . "இலக்கண")

    ("\\'" . "\\&ண")
    )
"tml-mey-big-na-knowledge")



(defvar tml-ir-knowledge
  `(
    ("\\<்\\'" . "அவர்")
    ("\\<ி\\'" . "இவர்")
    ("\\<ெ\\'" . "எவர்")
    ("\\<ொ\\'" . "ஒருவர்")
    ("\\<தொ\\'" . "தொல்காப்பியர்") ;; no words start with தொர்
    ("\\<தி\\'" . "திருவள்ளுவர்") ;; no words start with திர்
    ("\\<வள்\\'" . "வள்ளுவர்") ;; no words start with வள்ர்  
    ("\\<ஞ\\'" . "ஞானசம்பந்தர்") ;; no words start with ஞர்
    ("\\<திஞ\\'" . "திருஞானசம்பந்தர்") ;; no words start with திஞர்

    ;; ("ண்ட\\'" . "\\&னர்")
    ;; ("\\([தடறள]\\)்\\1\\'" . "\\&னர்")
    ;; ("ன்ற\\'" . "\\&னர்")
    ;; ("[யந]்த\\'" . "\\&னர்") ;;செய்தனர், வந்தனர்FIXME சம்பந்தர் சம்பந்தனர்
    
    ;; ("பின்\\'" . "\\&னர்")
    ;; ("ப்பி\\'" . "\\&னர்")
    ;; ("[ஙக]்கி\\'" . "\\&னர்") ;;இயங்கினர், இயக்கினர்.
    ;; THISISPRONETO error as in சம்பந்தர் சம்பந்தனர்...

    ("\\(ழுவி\\|பின்\\|ப்பி\\|ற்ற\\)\\'" . "\\&னர்")

    (,words-ending-with-nar  . "\\&னர்")
    (,words-ending-with-var  . "\\&வர்")
    (,words-ending-with-bignedilrar  . "\\&றார்")


    ("\\'" . "\\&ர்")
    )
"words ending with ர் ")


(defvar tml-eos-knowledge
  '(
    ("\\<பி\\'" . "பி.") ; to avoid it to turn into பிறகு

    ("\\<க\\'" . "காணமுடிகிறது.") ; the last point would be eaten by ...
    ("\\<ப\\'" . "பார்க்கமுடிகிறது.") ; the last point would be eaten by ...
    ("\\<கு\\'" . "குறிப்பிடுகின்றது.") ; the last point would be eaten by ...
    ("\\<ெ\\'" . "என்கின்றார்.") ; the last point would be eaten by ...
    ("\\<ி\\'" . "இடம்பெற்றுள்ளது.") ; the last point would be eaten by ...
    ("\\<்\\'" . "அறியமுடிகிறது.") ; the last point would be eaten by ...
    ("\\<ப்\\'" . "பாடலால் அறியமுடிகின்றது.") ; the last point would be eaten by ...
    ("\\<வ்\\'" . "வரிகளால் அறியமுடிகின்றது.") ; the last point would be eaten by ...

    
    ("\\<ந\\'" . "நடைபெற்றது.") ; the last point would be eaten by ...
    ("\\<்\\'" . "அறியமுடிகின்றது.") ; the last point would be eaten by ...
    ("\\<க\\'" . "கொண்டனர்.") ; the last point would be eaten by ...
    ("\\<வு\\'" . "வழங்கப்பட்டது.") ; the last point would be eaten by ...
    ("\\<வ\\'" . "வருகின்றனர்.") ; the last point would be eaten by ...
    ("\\<ே\\'" . "வேண்டும்.") ; the last point would be eaten by ...
    ("\\<ச\\'" . "செய்தனர்.") ; the last point would be eaten by ...
    ("\\<கு\\'" . "குறிப்பிடுகின்றார்.") ; the last point would be eaten by ...
    ("\\<ெ\\'" . "என்றார்.") ; the last point would be eaten by ...
    ("\\<ு\\'" . "உண்டு.") ; the last point would be eaten by ...
    ("\\<ா\\'" . "ஆகும்.") ; the last point would be eaten by ...
    ("\\'" . "\\&")
    )
"end of sentence knowledge")

(defvar tml-eol-knowledge
  '(


    ("\\<ம\\'" . "முன்னுரை\n")
    ("\\<மு\\'" . "முடிவுரை\n")
    ("\\<த\\'" . "துணைநூற்பட்டியல்\n")
    ("\\<ந\\'" . "நடைபெற்றது.\n")
    ("\\<ப\\'" . "படக்குறிப்பு:\n")
    ("\\<க\\'" . "கூறினார்.\n")        
 
    ("\\<ி\\'" . "இதனை,\n")
    ("\\<்\\'" . "அறியமுடிகின்றது.\n")
    ("\\<ச\\'" . "சொன்னார்.\n")
    ("\\<ெ\\'" . "என்றார்.\n")



    ("\\'" . "\\&")
    )
"end of line knowledge")



(defvar tml-same-suit-or-pause-knowledge
  '(
   ("\\<ம\\'" . "மேலும்,") ; the last comma would be eaten by ...
   ("\\<ட\\'" . "மட்டுமல்லாமல்,") ; the last comma would be eaten by ...
 
    ("\\<ப\\'" . "பற்றியும்,") ; the last comma would be eaten by ...
    ("\\<ா\\'" . "ஆனால்,") ;  the last comma would be eaten by ...
    ("\\<ி\\'" . "இதனை,") ;  the last comma would be eaten by ...
    ("\\<ெ\\'" . "என்றும்,") ;  the last comma would be eaten by ...


    ("\\'" . "\\&")
    )
"same-suit knowledge. list of things belonging ..., for comma mainly. or where we pause...")

(defvar tml-colon-knowledge
  '(
    ;("^தி\\'" . "திருக்குறள்:")
    ("\\'" . "\\&")
    )
"for colon")

(defvar tml-hyphen-knowledge
  '(
    ("\\<ப\\'" . "பாடல் எண் - ")
    ("\\<பா\\'" . "பாடல் - ")

    ("\\<ந\\'" . "நூற்பா - ")
    ("\\<நெ\\'" . "நூற்பா எண் - ")

    ("\\'" . "\\&")
    )
"for hyphen")

(defvar tml-closing-bracket-knowledge
  '(
    ("\\<ு\\'" . "உரையாசிரியர்)")
    ("\\<ப\\'" . "பதிப்பாசிரியர்)")

    ("\\'" . "\\&")
    )
"for hyphen")
    

(defvar tml-question-knowledge
  '(
    ("\\<ெ\\'" . "என்ன?") ; the last questionmark would be eaten by ...
    ("\\<ே\\'" . "ஏன்?") ; the last questionmark would be eaten by ...
    ("\\<ம\\'" . "முடியுமா?") ; the last questionmark would be eaten by ...
    ("\\<த\\'" . "தெரியுமா?") ; the last questionmark would be eaten by ...
    ("\\<ு\\'" . "உண்டோ?") ; the last questionmark would be eaten by ...
    ("\\<ய\\'" . "யார்?") ; the last questionmark would be eaten by ...
    ("\\<எ\\'" . "எப்படி?") ; the last questionmark would be eaten by ...
    ("\\'" . "\\&")
    )
"end of question knowledge")


(defvar tml-otru-migum-idam-knowledge
  `(
    ("\\([அஇஎ]த்தனை\\) " . "\\&") ; ஒற்று மிகா இடங்கள் leave it as it is... RMK: we don't even need to specify [கசதப] as we are preparing to leave it...
    ("\\([அஇஎ]வ்வளவு\\) " . "\\&") ; ஒற்று மிகா இடங்கள் leave it as it is...
    ("\\([அஇஎ]வை\\) " . "\\&") ; ஒற்று மிகா இடங்கள் leave it as it is...
    ("\\([அஇஎஏ]து\\) " . "\\&") ; ஒற்று மிகா இடங்கள் leave it as it is...
    ("\\([அஇஎ]ன்று\\) " . "\\&") ; ஒற்று மிகா இடங்கள் leave it as it is...
    ("\\(பண்டு\\) " . "\\&") ; ஒற்று மிகா இடங்கள் leave it as it is...
    ("\\(தனை\\|அளவு\\|வாளா\\|சும்மா\\|அடிக்கடி\\|தடவை\\|முறை\\|ஆவது\\|முன்பு\\|பின்பு\\|பிறகு\\|போது\\) " . "\\&") ; ஒற்று மிகா இடங்கள் leave it as it is...
    ("\\(யாவை\\) " . "\\&") ; ஒற்று மிகா இடங்கள் leave it as it is...
    ("\\(த்த\\) " . "\\&") ; ஒற்று மிகா இடங்கள் leave it as it is...
    ("\\(ந்து\\) " . "\\&") ; ஒற்று மிகா இடங்கள் leave it as it 
    (,otru-miga-idangal-regexp  .  "\\&") ; ஒற்று மிகா இடங்கள் leave it as it is...


    ("\\(ை\\) \\([கசதப]\\)" . "\\1\\2் \\2") ; தமிழைக் கண்டேன்...
    ("\\([கசடதபற]்.ு\\) \\([கசதப]\\)" . "\\1\\2் \\2") ; தேர்வுக்குப் போனான்... வன்றொடர் குற்றியலுகரம் (is all covered? what about other than ்) FIXME : வினையெச்சம் கூப்பு கைகள், ஈட்டு புகழ்
    ("\\([அஇஎ]ந்த\\) \\([கசதப]\\)" . "\\1\\2் \\2") ; இந்தச் சிற்பம் ...
    ("\\([அஇஎ]ப்படி\\) \\([கசதப]\\)" . "\\1\\2் \\2") ; அப்படிப் போனான்...
    ("\\([அஇஎ]வ்வகை\\) \\([கசதப]\\)" . "\\1\\2் \\2") ; எவ்வகைத் தோற்றம் ...
    ("\\([அஇஎஈ]ங்கு\\) \\([கசதப]\\)" . "\\1\\2் \\2") ; அங்குச் சென்றான்...
    ("\\(யாங்கு\\) \\([கசதப]\\)" . "\\1\\2் \\2") ; யாங்குக் கற்றாய்...
    ("\\([தஇ]னி\\) \\([கசதப]\\)" . "\\1\\2் \\2") ; இனிக் கேள்.
    ("\\(என\\) \\([கசதப]\\)" . "\\1\\2் \\2") ; எனச் சொன்னான்
    ("\\(மற்ற[ுை]?\\) \\([கசதப]\\)" . "\\1\\2் \\2") ; மற்றக் குதிரைகள்... மற்றுக், மற்றைக் ...
    ("\\(\\(?:மு\\|பி\\)ன்னர்\\) \\([கசதப]\\)" . "\\1\\2் \\2") ; முன்னர்க் கண்ட 
    ("\\(எல்லா\\) \\([கசதப]\\)" . "\\1\\2் \\2") ; எல்லாப் பெண்கள்

    ("\\<\\(தீ\\|பூ\\|ஈ\\) \\([கசதப]\\)" . "\\1\\2் \\2") ; தீ பூ ஈ  ஓரெழுத்து சொற்கள்

    ("\\(த்து\\) \\([கசதப]\\)" . "\\1\\2் \\2") ; பார்த்துப் போனான்.

    ("\\(ாக\\) \\([கசதப]\\)" . "\\1\\2் \\2") ; நன்றாகப் பாடினாள்.
    ("\\([ாோ]ய்\\) \\([கசதப]\\)" . "\\1\\2் \\2") ; ஓடுவதாய்ச் சொன்னான். போய்ச் சொல்
    ("\\([அஇ]ன்றி\\) \\([கசதப]\\)" . "\\1\\2் \\2") ; அன்றிச் சொல்லான்.
    ("\\(போல\\) \\([கசதப]\\)" . "\\1\\2் \\2") ; போலச் செய்.
    ("\\(கிலோ\\|மில்லி\\|லிட்டர்\\|மீட்டர்\\) \\([கசதப]\\)" . "\\1\\2் \\2") ; ஒரு கிலோப் பயறு ...



    )
"Associative list of ஒற்று மிகும் இடங்கள்")

;(load "delete_variables.el")

(provide 'tamil-grammar-knowledge)
